TaurusDemo.yml
---
execution:
- concurrency: 10
  hold-for: 5m
  ramp-up: 30s
  scenario: sample
  
scenarios:
  sample:
    requests:
    - http://blazedemo.com
    - http://blazedemo.com/reserve.php
    
reporting:
- module: blazemeter

settings: 
  default-executor: jmeter
  
provisioning: cloud

modules: 
  cloud: 
    token: 6101a4123225344c45f3
    timeout: 10s
    browser-open: start